//=============================================================================
// tutorial.cpp
// 作成者：髙木歩夢　作成日：2023/01/02
//=============================================================================

#include "tutorial.h"
#include "sprite.h"
#include "texture.h"

//===================================
//マクロ定義
//===================================


//===================================
//プロトタイプ宣言
//===================================


//===================================
//グローバル変数
//===================================

static TUTORIAL g_tutorial;

//===================================
//初期化
//===================================
HRESULT InitTutorial()
{


	//UIの初期化
	g_tutorial.pos.x = 0 + 80;
	g_tutorial.pos.y = 0 + 100;

	g_tutorial.Size = D3DXVECTOR2(100, 100);

	g_tutorial.use = true;

	g_tutorial.textutorial_01_01 = LoadTexture(g_TextureTutorial_01_01);

	//g_tutorial.Color = D3DXCOLOR(1.0f,1.0f,1.0f,1.0f)

	return S_OK;
}

//===================================
//終了
//===================================
void    UnInitTutorial()
{

}


//===================================
//描画
//===================================
void    DrawTutorial()
{
	// チュートリアル表示
	if (g_tutorial.use)
	{

	}
}


//===================================
//更新
//===================================
void    UpdateTutorial()
{

}

